app/controllers/posts/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
INSERT INTO `comments` (`comment`, `created_at`, `title`, `commentable_type`, `confirm`, `commentable_id`, `user_id`) VALUES('wefwqefwe fwq fw', '2010-05-20 04:50:51', '', 'Post', 0, 4, 1)
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    @comment.user = current_user if logged_in?
    if @comment.save

UPDATE `comments` SET `confirm` = 1 WHERE `id` = 4
---
  def update
    if @comment.update_attribute(:confirm, true)

DELETE FROM `comments` WHERE (`id` IN (1))
---
  def destroy
    if @comment.delete

SELECT * FROM `comments` WHERE (`comments`.`id` = 4)
---
  def find_comment
    @comment = Comment.find(params[:id])