app/controllers/activations_controller.rb

SELECT * FROM `users` WHERE (perishable_token = 'dYX17KVPhKEfhgDZJOJ_' and updated_at > '2010-05-13 07:07:55') LIMIT 1
---
  def new
    @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def create
    @user = User.find(params[:id])