app/controllers/search_controller.rb

  def by_tag
    @posts = Post.find_tagged_with(params[:tag])
---
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_id = 7) AND (`taggings`.taggable_type = 'Post'))

  def by_category
    @posts = Post.find_all_by_category_id(params[:category_id])
---
SELECT * FROM `posts` WHERE (`posts`.`category_id` = '21') ORDER BY created_at DESC