app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save_without_session_maintenance
---
INSERT INTO `users` (`single_access_token`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `password_salt`, `persistence_token`, `email`, `active`) VALUES('VnwFVCLXHttp6NVASnLO', '2010-05-20 07:07:41', '99bf508d626ee98dccb553ee6956a069c730aada905c52e2b8ab1e415e462c26391e871f8e1534b828c1be419c3448bb5932c6c9c4cb94eebfd82e3e3fcf1ec0', 'yS8ImgvUVfrvlw05DtJb', '2010-05-20 07:07:41', 'JV0EpMjj7IioaxmFWYGb', '14c96e38219fa27d13bdd21f857f9006d239bcdc447f567ca97e1ab28abfa7a516a5ca04089bb0f43b5ff96516ef5549f37229d26e353c939da00d1f64365661', 'mearion@gmail.com', 0)